app/Http/Controllers/DepartmentController.php

select * from `departments` limit 5 offset 0
select count(*) as aggregate from `departments`
---
    public function index()
    {
        $id = Department::paginate(5);

select * from `departments`
---
    public function create()
    {
        // $this->middleware('auth');
        //using model
        $dep = Department::all();