app/Http/Controllers/SelectController.php

    public function destroy(Select $select)
    {
        // dd($select);
        // $user = Select::findOrFail($select);
        // $user->delete();

        // return redirect('/admin/users');

        // $post = Select::find($select);
        // $post->delete();
        // return redirect()->back();

        $select->delete();
---
delete from `selects` where `id` = 10