app/Http/Controllers/SelectController.php

    public function index()
    {
        $selects = Select::latest()->get();
---
select * from `selects` order by `created_at` desc

    public function store(Request $request)
    {
        // return $request;
        $post = new Select();
        $post->cars = $request->cars;
        $post->save();
---
insert into `selects` (`cars`, `updated_at`, `created_at`) values ('saab', '2023-01-06 11:42:33', '2023-01-06 11:42:33')

    public function edit(Select $select)
    {
        // // $data = Select::find($id);
        // $data = Select::find($id);

        // return view('edit', compact('data'));

        $idWiseValue = $select;

        // return view('edit', compact('select'));
        $selects = Select::all();
---
select * from `selects`

    public function update(Select $select, Request $request)
    {
        // // Request $request, Select $select
        // $students = Select::find($id);
        // $select->cars = $select->cars;
        // $students->save();

        // return $request->all();
        $select->update($request->all());
---
update `selects` set `cars` = 'Saab', `selects`.`updated_at` = '2023-01-14 07:21:46' where `id` = 38