app/Providers/AppServiceProvider.php

    public function boot()
    {
        // way 1
        $selects = Select::get();
---
select * from `selects`