app/Providers/AppServiceProvider.php

select * from `departments` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `departments`
---
    public function boot()
    {
        // way 1
        // $d = Department::all();
        // View::share('d',$d);

        // way 2
        // View::share('d', Department::get());

        // way 3
        View::composer(['welcome','student'], function ($view) {
            $view->with('d', Department::orderByDesc('created_at')->paginate());
        });